html/kafka/workflow.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>流程</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Wu, Shanliang" />
<link rel="stylesheet" type="text/css" href="css/main.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="cluster.html"> UP </a>
 |
 <a accesskey="H" href="kafka.html"> HOME </a>
</div><div id="content">
<h1 class="title">流程</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge8d79d9">发布/订阅消息</a></li>
<li><a href="#org66be4e4">队列消息/用户组的工作流</a></li>
<li><a href="#org48f1926">ZooKeeper的作用</a></li>
</ul>
</div>
</div>
<pre class="example">
Kafka只是分为一个或多个分区的主题的集合。 Kafka分区是消息的线性有序序列，其中每个消息由它们的索引(称为偏移)来标识
Kafka集群中的所有数据都是不相连的分区联合。 传入消息写在分区的末尾，消息由消费者顺序读取。 通过将消息复制到不同的代理提供持久性

Kafka以快速，可靠，持久，容错和零停机的方式提供基于pub-sub和队列的消息系统
在这两种情况下，生产者只需将消息发送到主题，消费者可以根据自己的需要选择任何一种类型的消息传递系统
</pre>
<div id="outline-container-orge8d79d9" class="outline-2">
<h2 id="orge8d79d9">发布/订阅消息</h2>
<div class="outline-text-2" id="text-orge8d79d9">
<p>
以下是Pub/Sub消息的逐步工作流程：
</p>
<ol class="org-ol">
<li>生产者 <b>定期</b> 向 <span class="underline">主题</span> <b>发送</b> <span class="underline">消息</span></li>
<li><span class="underline">Kafka代理</span> <b>存储</b> 为 <span class="underline">该特定主题</span> 配置的 <span class="underline">分区</span> 中的所有消息，它确保 <b>消息在分区之间平等共享</b> 
<ul class="org-ul">
<li>如果生产者发送两个消息并且有两个分区，Kafka将在第一分区中存储一个消息，在第二分区中存储第二消息</li>
</ul></li>
<li>消费者 <b>订阅</b> 特定 <span class="underline">主题</span></li>
<li>一旦消费者订阅主题，Kafka将向消费者 <b>提供</b> <span class="underline">主题的当前偏移</span> ，并且还将 <span class="underline">偏移</span> <b>保存</b> 在Zookeeper系综中</li>
<li>消费者将 <b>定期请求</b> Kafka(如100 Ms)新消息</li>
<li>一旦Kafka收到来自生产者的消息，它将这些消息 <b>转发</b> 给 <span class="underline">消费者</span></li>
<li>消费者将收到消息并进行处理</li>
<li>一旦  <span class="underline">消息被处理</span> ， <span class="underline">消费者</span> 将向 <span class="underline">Kafka代理</span> <b>发送确认</b></li>
<li>一旦 <span class="underline">Kafka收到确认</span> ，它将 <span class="underline">偏移</span> <b>更改为新值</b> ，并在 <span class="underline">Zookeeper</span> 中 <b>更新</b> 它
<ul class="org-ul">
<li>由于偏移在Zookeeper中维护，消费者可以正确地读取下一封邮件，即使在服务器暴力期间。</li>
</ul></li>
</ol>

<p>
以上流程将重复，直到消费者停止请求
</p>

<pre class="example">
    消费者可以随时回退/跳到所需的主题偏移量，并阅读所有后续消息
</pre>
</div>
</div>
<div id="outline-container-org66be4e4" class="outline-2">
<h2 id="org66be4e4">队列消息/用户组的工作流</h2>
<div class="outline-text-2" id="text-org66be4e4">
<p>
<span class="underline">队列消息传递</span> 系统： <b>具有相同组ID</b> 的 <span class="underline">一组消费者</span> 将 <b>订阅</b> <span class="underline">主题</span> 
</p>

<pre class="example">
    简单来说，订阅具有相同 Group ID 的主题的消费者被认为是单个组，并且消息在它们之间共享
</pre>

<p>
这个系统的实际工作流程：
</p>
<ol class="org-ol">
<li>生产者以固定间隔向某个主题发送消息</li>
<li>Kafka存储在为该特定主题配置的分区中的所有消息，类似于前面的方案</li>
<li>单个消费者订阅特定主题，假设主题为 <span class="underline">Topic-01</span> , Group ID 为 <span class="underline">Group-1</span></li>
<li>Kafka以与发布/订阅消息相同的方式与消费者交互，直到 <b>新消费者</b> 以 <span class="underline">相同的组ID</span> (Group-1) <b>订阅</b> <span class="underline">相同主题</span> (Topic-01)</li>
<li>一旦新消费者到达，Kafka将其操作切换到 <b>共享模式</b> ，并在 <b>两个消费者之间</b> 共享数据。 此共享将继续，直到 <b>用户数达到为该特定主题配置的分区数</b></li>
<li>一旦 <span class="underline">消费者的数量</span> 超过 <span class="underline">分区的数量</span> ， <span class="underline">新消费者</span> 将 <b>不会接收</b> <span class="underline">任何进一步的消息</span> ，直到 <b>任何一个现有消费者取消订阅</b></li>
</ol>

<pre class="example">
    出现这种情况是因为Kafka中的每个消费者将被分配至少一个分区，并且一旦所有分区被分配给现有消费者，新消费者将必须等待
</pre>
</div>
</div>
<div id="outline-container-org48f1926" class="outline-2">
<h2 id="org48f1926">ZooKeeper的作用</h2>
<div class="outline-text-2" id="text-org48f1926">
<p>
Kafka的一个关键依赖是 <span class="underline">Zookeeper</span> ，它是一个 <b>分布式</b> <span class="underline">配置</span> 和 <span class="underline">同步</span> 服务：
</p>
<ul class="org-ul">
<li>Zookeeper是Kafka <b>代理和消费者之间的协调接口</b></li>
<li>Kafka服务器通过 <span class="underline">Zookeeper集群</span> <b>共享信息</b></li>
<li>Kafka在Zookeeper中 <b>存储</b> <span class="underline">基本元数据</span> ，例如： 
<ul class="org-ul">
<li>主题</li>
<li>代理</li>
<li>消费者偏移</li>
</ul></li>
</ul>

<pre class="example">
由于所有关键信息存储在Zookeeper中，并且它通常在其整体上复制此数据，因此Kafka代理/ Zookeeper的故障不会影响Kafka集群的状态

一旦Zookeeper重新启动，Kafka将恢复状态，这为Kafka带来了零停机时间

Kafka代理之间的领导者选举也通过使用Zookeeper在领导者失败的情况下完成
</pre>

<p>
<a href="operation.html">Next: 操作</a>
</p>

<p>
<a href="cluster.html">Previous: 集群</a>
</p>

<p>
<a href="kafka.html">Home: 目录</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">

		  <br/>
		  <div class='ds-thread'></div>
		  <script>
		  var duoshuoQuery = {short_name:'klose911'};
		  (function() {
					  var dsThread = document.getElementsByClassName('ds-thread')[0];
					  dsThread.setAttribute('data-thread-key', document.title);
					  dsThread.setAttribute('data-title', document.title);
					  dsThread.setAttribute('data-url', window.location.href);
					  var ds = document.createElement('script');
					  ds.type = 'text/javascript';ds.async = true;
					  ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
					  ds.charset = 'UTF-8';
					  (document.getElementsByTagName('head')[0] 
						|| document.getElementsByTagName('body')[0]).appendChild(ds);
					  })();
		  </script>
		  <script>
		  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
			(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
			m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
			})(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
		  ga('create', 'UA-90850421-1', 'auto');
		  ga('send', 'pageview');
		  </script>
</div>
</body>
</html>
